[Killed] PublicVisibility
Bank.php:25:5
      * @param float $rate
      * @return Bank
      */
-    public static function create(Currency $startCurrency, Currency $endCurrency, float $rate): Bank
+    protected static function create(Currency $startCurrency, Currency $endCurrency, float $rate) : Bank
     {
         $bank = new Bank([]);
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
Error: Call to protected method MoneyProblem\Domain\Bank::create() from scope Tests\MoneyProblem\ConvertMoneyTest

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:15

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Bank.php:28:9
     public static function create(Currency $startCurrency, Currency $endCurrency, float $rate): Bank
     {
         $bank = new Bank([]);
-        $bank->addEchangeRate($startCurrency, $endCurrency, $rate);
+        
 
         return $bank;
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:48
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:20

ERRORS!
Tests: 1, Assertions:

[Killed] PublicVisibility
Bank.php:39:5
      * @param float $rate
      * @return void
      */
-    public function addEchangeRate(Currency $startCurrency, Currency $endCurrency, float $rate): void
+    protected function addEchangeRate(Currency $startCurrency, Currency $endCurrency, float $rate) : void
     {
         $this->exchangeRates[($startCurrency . '->' . $endCurrency)] = $rate;
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_with_different_exchange_rates
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_with_different_exchange_rates
Error: Call to protected method MoneyProblem\Domain\Bank::addEchangeRate() from scope Tests\MoneyProblem\ConvertMoneyTest

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:40

ERRORS!
Tests: 4, Assertions: 5, Errors: 1.

[Killed] Concat
Bank.php:41:9
      */
     public function addEchangeRate(Currency $startCurrency, Currency $endCurrency, float $rate): void
     {
-        $this->exchangeRates[($startCurrency . '->' . $endCurrency)] = $rate;
+        $this->exchangeRates['->' . $startCurrency . $endCurrency] = $rate;
     }
 
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:48
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:20

ERRORS!
Tests: 1, Assertions:

[Killed] Concat
Bank.php:41:9
      */
     public function addEchangeRate(Currency $startCurrency, Currency $endCurrency, float $rate): void
     {
-        $this->exchangeRates[($startCurrency . '->' . $endCurrency)] = $rate;
+        $this->exchangeRates[$startCurrency . $endCurrency . '->'] = $rate;
     }
 
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:48
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:20

ERRORS!
Tests: 1, Assertions:

[Killed] PublicVisibility
Bank.php:51:5
      * @return float
      * @throws MissingExchangeRateException
      */
-    public function convert(float $amount, Currency $startCurrency, Currency $endCurrency): float
+    protected function convert(float $amount, Currency $startCurrency, Currency $endCurrency) : float
     {
         if (!($this->isConvertible($startCurrency,$endCurrency))) {
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
Error: Call to protected method MoneyProblem\Domain\Bank::convert() from scope Tests\MoneyProblem\ConvertMoneyTest

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:20

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LogicalNot
Bank.php:53:9
      */
     public function convert(float $amount, Currency $startCurrency, Currency $endCurrency): float
     {
-        if (!($this->isConvertible($startCurrency,$endCurrency))) {
+        if ($this->isConvertible($startCurrency, $endCurrency)) {
             throw new MissingExchangeRateException($startCurrency, $endCurrency);
         }
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:48
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:20

ERRORS!
Tests: 1, Assertions:

[Killed] Throw_
Bank.php:54:13
     public function convert(float $amount, Currency $startCurrency, Currency $endCurrency): float
     {
         if (!($this->isConvertible($startCurrency,$endCurrency))) {
-            throw new MissingExchangeRateException($startCurrency, $endCurrency);
+            new MissingExchangeRateException($startCurrency, $endCurrency);
         }
         return $startCurrency == $endCurrency
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_without_exchange_rate
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_without_exchange_rate
Undefined array key "EUR->KRW"

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:50
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:34

ERRORS!
Tests: 3, Assertions: 2, Errors: 1.

[Killed] Ternary
Bank.php:56:9
         if (!($this->isConvertible($startCurrency,$endCurrency))) {
             throw new MissingExchangeRateException($startCurrency, $endCurrency);
         }
-        return $startCurrency == $endCurrency
-            ? $amount
-            : $amount * $this->exchangeRates[($startCurrency . '->' . $endCurrency)];
+        return $startCurrency == $endCurrency ? $amount * $this->exchangeRates[$startCurrency . '->' . $endCurrency] : $amount;($startCurrency . '->' . $endCurrency)];
     }
 
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
Failed asserting that 10.0 matches expected 12.

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:21

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] AssignmentEqual
Bank.php:56:9
         if (!($this->isConvertible($startCurrency,$endCurrency))) {
             throw new MissingExchangeRateException($startCurrency, $endCurrency);
         }
-        return $startCurrency == $endCurrency
+        return ($startCurrency = $endCurrency) ? $amount : $amount * $this->exchangeRates[$startCurrency . '->' . $endCurrency];
             ? $amount
             : $amount * $this->exchangeRates[($startCurrency . '->' . $endCurrency)];
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
Failed asserting that 10.0 matches expected 12.

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:21

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ConcatOperandRemoval
Bank.php:58:13
         }
         return $startCurrency == $endCurrency
             ? $amount
-            : $amount * $this->exchangeRates[($startCurrency . '->' . $endCurrency)];
+            return $startCurrency == $endCurrency ? $amount : $amount * $this->exchangeRates[$startCurrency . $endCurrency];
     }
 
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
Undefined array key "EURUSD"

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:50
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:20

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Concat
Bank.php:58:13
         }
         return $startCurrency == $endCurrency
             ? $amount
-            : $amount * $this->exchangeRates[($startCurrency . '->' . $endCurrency)];
+            return $startCurrency == $endCurrency ? $amount : $amount * $this->exchangeRates['->' . $startCurrency . $endCurrency];
     }
 
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
Undefined array key "->EURUSD"

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:50
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:20

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] PublicVisibility
Bank.php:66:5
      * @param Currency $endCurrency
      * @return bool
      */
-    public function isConvertible(Currency $startCurrency, Currency $endCurrency): bool
+    protected function isConvertible(Currency $startCurrency, Currency $endCurrency) : bool
     {
         return $startCurrency == $endCurrency || array_key_exists($startCurrency . '->' . $endCurrency, $this->exchangeRates);

[Killed] ConcatOperandRemoval
Bank.php:68:9
      */
     public function isConvertible(Currency $startCurrency, Currency $endCurrency): bool
     {
-        return $startCurrency == $endCurrency || array_key_exists($startCurrency . '->' . $endCurrency, $this->exchangeRates);
+        return $startCurrency == $endCurrency || array_key_exists($startCurrency . '->', $this->exchangeRates);
     } 
 
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:48
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:20

ERRORS!
Tests: 1, Assertions:

[Killed] Concat
Bank.php:68:9
      */
     public function isConvertible(Currency $startCurrency, Currency $endCurrency): bool
     {
-        return $startCurrency == $endCurrency || array_key_exists($startCurrency . '->' . $endCurrency, $this->exchangeRates);
+        return $startCurrency == $endCurrency || array_key_exists($startCurrency . $endCurrency . '->', $this->exchangeRates);
     } 
 
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:48
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:20

ERRORS!
Tests: 1, Assertions:
