[Killed] MethodCallRemoval
MissingExchangeRateException.php:14:9
      */
     public function __construct(Currency $startCurrency, Currency $endCurrency)
     {
-        parent::__construct(sprintf('%s->%s', $startCurrency, $endCurrency));
+        
 
     }
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_without_exchange_rate
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_without_exchange_rate
Failed asserting that exception message '' contains 'EUR->KRW'.

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.
