[Killed] PublicVisibility
MoneyCalculator.php:12:5
      * @param Currency $currency
      * @param float $addedAmount
      */
-    public static function add(float $initialAmount, Currency $currency, float $addedAmount): float
+    protected static function add(float $initialAmount, Currency $currency, float $addedAmount) : float
     {
         return $initialAmount + $addedAmount;
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_add_in_usd_returns_value
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_add_in_usd_returns_value
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::add() from scope Tests\MoneyProblem\MoneyCalculatorTest

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\MoneyCalculatorTest.php:13

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] Plus
MoneyCalculator.php:14:9
      */
     public static function add(float $initialAmount, Currency $currency, float $addedAmount): float
     {
-        return $initialAmount + $addedAmount;
+        return $initialAmount - $addedAmount;
     }
 

[Killed] PublicVisibility
MoneyCalculator.php:22:5
      * @param Currency $currency
      * @param int $value
      */
-    public static function times(float $initialAmount, Currency $currency, int $value): float
+    protected static function times(float $initialAmount, Currency $currency, int $value) : float
     {
         return $initialAmount * $value;
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_multiply_in_euros_returns_positive_number
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_multiply_in_euros_returns_positive_number
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::times() from scope Tests\MoneyProblem\MoneyCalculatorTest

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\MoneyCalculatorTest.php:20

ERRORS!
Tests: 2, Assertions: 2, Errors: 1.

[Survived] Multiplication
MoneyCalculator.php:24:9
      */
     public static function times(float $initialAmount, Currency $currency, int $value): float
     {
-        return $initialAmount * $value;
+        return $initialAmount / $value;
     }
     

[Killed] PublicVisibility
MoneyCalculator.php:32:5
      * @param Currency $currency
      * @param int $value
      */
-    public static function divide(float $initialAmount, Currency $currency, int $value): float
+    protected static function divide(float $initialAmount, Currency $currency, int $value) : float
     {
         return $initialAmount / $value;
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_divide_in_korean_won_returns_float
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_divide_in_korean_won_returns_float
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::divide() from scope Tests\MoneyProblem\MoneyCalculatorTest

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\MoneyCalculatorTest.php:26

ERRORS!
Tests: 3, Assertions: 3, Errors: 1.

[Killed] Division
MoneyCalculator.php:34:9
      */
     public static function divide(float $initialAmount, Currency $currency, int $value): float
     {
-        return $initialAmount / $value;
+        return $initialAmount * $value;
     }
 }
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_divide_in_korean_won_returns_float
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_divide_in_korean_won_returns_float
Failed asserting that 1000.5 matches expected 16008.0.

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\MoneyCalculatorTest.php:27

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.
