[Survived] MethodCallRemoval
Bank.php:32:9
     {
         //GUARD if (non pivot){pete}else bank new
         $bank = new Bank($startCurrency, []);
-        $bank->addEchangeRate($startCurrency, $endCurrency, $rate);
+        
 
         return $bank;

[Killed] Equal
Bank.php:45:9
      */
     public function addEchangeRate(Currency $startCurrency, Currency $endCurrency, float $rate): void
     {
-        if ((string)$startCurrency == (string)$this->pivotCurrency) {
+        if ((string) $startCurrency != (string) $this->pivotCurrency) {
             $this->newExchangeRates[(string)$endCurrency] = $rate;
         }
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_krw_to_usd_with_pivot_currency_eur
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_krw_to_usd_with_pivot_currency_eur
MoneyProblem\Domain\MissingExchangeRateException: KRW->USD

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:53
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:51

ERRORS!

[Survived] CastString
Bank.php:45:9
      */
     public function addEchangeRate(Currency $startCurrency, Currency $endCurrency, float $rate): void
     {
-        if ((string)$startCurrency == (string)$this->pivotCurrency) {
+        if ($startCurrency == (string) $this->pivotCurrency) {
             $this->newExchangeRates[(string)$endCurrency] = $rate;
         }

[Killed] ConcatOperandRemoval
Bank.php:49:9
             $this->newExchangeRates[(string)$endCurrency] = $rate;
         }
 
-        $this->exchangeRates[($startCurrency . '->' . $endCurrency)] = $rate;
+        $this->exchangeRates[$startCurrency . $endCurrency] = $rate;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluate_usd_to_eur
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluate_usd_to_eur
MoneyProblem\Domain\MissingExchangeRateException: USD->EUR

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:53
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:67
C:\Users\mathi\Documents\Travail\B

[Killed] ConcatOperandRemoval
Bank.php:49:9
             $this->newExchangeRates[(string)$endCurrency] = $rate;
         }
 
-        $this->exchangeRates[($startCurrency . '->' . $endCurrency)] = $rate;
+        $this->exchangeRates[$startCurrency . '->'] = $rate;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluate_usd_to_eur
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluate_usd_to_eur
MoneyProblem\Domain\MissingExchangeRateException: USD->EUR

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:53
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:67
C:\Users\mathi\Documents\Travail\B

[Killed] PublicVisibility
Bank.php:52:5
         $this->exchangeRates[($startCurrency . '->' . $endCurrency)] = $rate;
     }
 
-    public function convertMoney(Money $money, Currency $endCurrency): Money
+    protected function convertMoney(Money $money, Currency $endCurrency) : Money
     {
         if (($this->isconvertible($money->getCurrency(), $endCurrency))) {
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
Error: Call to protected method MoneyProblem\Domain\Bank::convertMoney() from scope Tests\MoneyProblem\ConvertMoneyTest

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:28

ERRORS!
Tests: 6, Assertions: 5, Errors: 1.

[Killed] IfNegation
Bank.php:54:9
 
     public function convertMoney(Money $money, Currency $endCurrency): Money
     {
-        if (($this->isconvertible($money->getCurrency(), $endCurrency))) {
-            return $money->hasCurrency($endCurrency)
-            ? $money
-            : $money->convert($money->getAmmount() * $this->exchangeRates[($money->getCurrency() . '->' . $endCurrency)], $endCurrency);
-        } 
-        else if (($this->isNewConvertible($money->getCurrency(), $endCurrency))) {
-            return $money->hasCurrency($endCurrency)
-            ? $money
-            : $money->convert(($money->getAmmount() / $this->newExchangeRates[(string)$money->getCurrency()]) * $this->newExchangeRates[(string)$endCurrency], $endCurrency);
-        }
-        else {
-            throw new MissingExchangeRateException($money->getCurrency(), $endCurrency);
-        }
+        if (!$this->isconvertible($money->getCurrency(), $endCurrency)) {
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluate_usd_to_eur
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluate_usd_to_eur
MoneyProblem\Domain\MissingExchangeRateException: USD->EUR

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:53
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:67
C:\Users\mathi\Documents\Travail\B

[Killed] ConcatOperandRemoval
Bank.php:57:13
         if (($this->isconvertible($money->getCurrency(), $endCurrency))) {
             return $money->hasCurrency($endCurrency)
             ? $money
-            : $money->convert($money->getAmmount() * $this->exchangeRates[($money->getCurrency() . '->' . $endCurrency)], $endCurrency);
+            return $money->hasCurrency($endCurrency) ? $money : $money->convert($money->getAmmount() * $this->exchangeRates['->' . $endCurrency], $endCurrency);
         } 
         else if (($this->isNewConvertible($money->getCurrency(), $endCurrency))) {
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluate_usd_to_eur
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluate_usd_to_eur
Undefined array key "->EUR"

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:48
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:67
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_lesl

[Killed] ConcatOperandRemoval
Bank.php:57:13
         if (($this->isconvertible($money->getCurrency(), $endCurrency))) {
             return $money->hasCurrency($endCurrency)
             ? $money
-            : $money->convert($money->getAmmount() * $this->exchangeRates[($money->getCurrency() . '->' . $endCurrency)], $endCurrency);
+            return $money->hasCurrency($endCurrency) ? $money : $money->convert($money->getAmmount() * $this->exchangeRates[$money->getCurrency() . $endCurrency], $endCurrency);
         } 
         else if (($this->isNewConvertible($money->getCurrency(), $endCurrency))) {
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluate_usd_to_eur
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluate_usd_to_eur
Undefined array key "USDEUR"

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:48
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:67
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_les

[Killed] IfNegation
Bank.php:59:9
             ? $money
             : $money->convert($money->getAmmount() * $this->exchangeRates[($money->getCurrency() . '->' . $endCurrency)], $endCurrency);
         } 
-        else if (($this->isNewConvertible($money->getCurrency(), $endCurrency))) {
-            return $money->hasCurrency($endCurrency)
-            ? $money
-            : $money->convert(($money->getAmmount() / $this->newExchangeRates[(string)$money->getCurrency()]) * $this->newExchangeRates[(string)$endCurrency], $endCurrency);
-        }
-        else {
-            throw new MissingExchangeRateException($money->getCurrency(), $endCurrency);
-        }
+        if (!$this->isNewConvertible($money->getCurrency(), $endCurrency)) {
     }
 
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_krw_to_usd_with_pivot_currency_eur
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_krw_to_usd_with_pivot_currency_eur
MoneyProblem\Domain\MissingExchangeRateException: KRW->USD

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:53
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:51

ERRORS!

[Killed] Throw_
Bank.php:65:13
             : $money->convert(($money->getAmmount() / $this->newExchangeRates[(string)$money->getCurrency()]) * $this->newExchangeRates[(string)$endCurrency], $endCurrency);
         }
         else {
-            throw new MissingExchangeRateException($money->getCurrency(), $endCurrency);
+            new MissingExchangeRateException($money->getCurrency(), $endCurrency);
         }
     }
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_without_exchange_rate
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_without_exchange_rate
Failed asserting that exception of type "TypeError" matches expected exception "MoneyProblem\Domain\MissingExchangeRateException". Message was: "MoneyProblem\Domain\Bank::convertMoney(): Return value must be of type MoneyProblem\Domain\Money, none returned" at
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-works

[Killed] LogicalOrAllSubExprNegation
Bank.php:90:9
      */
     private function isconvertible(Currency $startCurrency, Currency $endCurrency): bool
     {
-        return $startCurrency == $endCurrency || array_key_exists($startCurrency . '->' . $endCurrency, $this->exchangeRates);
+        return !($startCurrency == $endCurrency) || !array_key_exists($startCurrency . '->' . $endCurrency, $this->exchangeRates);
     }
 
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_krw_to_usd_with_pivot_currency_eur
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_krw_to_usd_with_pivot_currency_eur
Undefined array key "KRW->USD"

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:48
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:51

ERRORS!
Tests: 8, Assertions: 7, E

[Killed] LogicalAndSingleSubExprNegation
Bank.php:100:9
      */
     private function isNewConvertible(Currency $startCurrency, Currency $endCurrency): bool
     {
-        return $startCurrency == $endCurrency || array_key_exists((string)$startCurrency, $this->newExchangeRates) && array_key_exists((string)$endCurrency, $this->newExchangeRates);
+        return $startCurrency == $endCurrency || !array_key_exists((string) $startCurrency, $this->newExchangeRates) && array_key_exists((string) $endCurrency, $this->newExchangeRates);
     }
 }
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_krw_to_usd_with_pivot_currency_eur
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_krw_to_usd_with_pivot_currency_eur
MoneyProblem\Domain\MissingExchangeRateException: KRW->USD

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:53
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:51

ERRORS!

[Killed] LogicalOr
Bank.php:100:9
      */
     private function isNewConvertible(Currency $startCurrency, Currency $endCurrency): bool
     {
-        return $startCurrency == $endCurrency || array_key_exists((string)$startCurrency, $this->newExchangeRates) && array_key_exists((string)$endCurrency, $this->newExchangeRates);
+        return $startCurrency == $endCurrency && (array_key_exists((string) $startCurrency, $this->newExchangeRates) && array_key_exists((string) $endCurrency, $this->newExchangeRates));
     }
 }
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_krw_to_usd_with_pivot_currency_eur
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_krw_to_usd_with_pivot_currency_eur
MoneyProblem\Domain\MissingExchangeRateException: KRW->USD

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:53
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:51

ERRORS!
