[Killed] MethodCallRemoval
CanNotAddDifferentCurrency.php:14:9
      */
     public function __construct(Currency $startCurrency, Currency $endCurrency)
     {
-        parent::__construct(sprintf('%s+%s', $startCurrency, $endCurrency));
+        
 
     }
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_can_not_add_money_when_currency_are_different
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_can_not_add_money_when_currency_are_different
Failed asserting that exception message '' contains 'EUR+USD'.

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.
