[Killed] MethodCallRemoval
CanNotCreateNegativeAmount.php:10:9
 
     public function __construct()
     {
-        parent::__construct(sprintf('dont create negative amount'));
+        
 
     }
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_multiply_negative
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_multiply_negative
Failed asserting that exception message '' contains 'dont create negative amount'.

FAILURES!
Tests: 5, Assertions: 9, Failures: 1.
