[Killed] MethodCallRemoval
CanNotDivideByZero.php:13:9
      */
     public function __construct(int $value)
     {
-        parent::__construct(sprintf('dont divide by %s', $value));
+        
 
     }
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_divide_by_zero
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_divide_by_zero
Failed asserting that exception message '' contains 'dont divide by 0'.

FAILURES!
Tests: 6, Assertions: 11, Failures: 1.
