[NoCoverage] MethodCallRemoval
CanNotMultiplyByNegativeValue.php:13:9
      */
     public function __construct(int $value)
     {
-        parent::__construct(sprintf('dont multiply by %s', $value));
+        
 
     }
