[Killed] PublicVisibility
Money.php:15:5
     /**
      * @throws CanNotCreateNegativeAmount
      */
-    static function fabricMoney(float $amount, Currency $currency): Money
+    protected static function fabricMoney(float $amount, Currency $currency) : Money
     {
         if ($amount < 0) {
killedBy: Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
statusReason: 1) Tests\MoneyProblem\ConvertMoneyTest::test_bank_convert_eur_to_usd
Error: Call to protected method MoneyProblem\Domain\Money::fabricMoney() from scope Tests\MoneyProblem\ConvertMoneyTest

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\ConvertMoneyTest.php:28

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
Money.php:18:13
     static function fabricMoney(float $amount, Currency $currency): Money
     {
         if ($amount < 0) {
-            throw new CanNotCreateNegativeAmount();
+            new CanNotCreateNegativeAmount();
         }
         return new Money($amount, $currency);
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_multiply_negative
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_multiply_negative
Failed asserting that exception of type "MoneyProblem\Domain\CanNotCreateNegativeAmount" is thrown.

FAILURES!
Tests: 5, Assertions: 8, Failures: 1.

[Killed] PublicVisibility
Money.php:32:5
     /**
      * @throws CanNotAddDifferentCurrency
      */
-    public function add(Money $money): Money
+    protected function add(Money $money) : Money
     {
         if ($money->currency != $this->currency) {
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_can_add_money_when_currency_are_the_same
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_can_add_money_when_currency_are_the_same
Error: Call to protected method MoneyProblem\Domain\Money::add() from scope Tests\MoneyProblem\MoneyCalculatorTest

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\MoneyCalculatorTest.php:33

ERRORS!
Tests: 2, Assertions: 3, Errors: 1.

[Killed] NotEqual
Money.php:34:9
      */
     public function add(Money $money): Money
     {
-        if ($money->currency != $this->currency) {
+        if ($money->currency == $this->currency) {
             throw new CanNotAddDifferentCurrency($money->currency, $this->currency);
         }
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_can_add_money_when_currency_are_the_same
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_can_add_money_when_currency_are_the_same
MoneyProblem\Domain\CanNotAddDifferentCurrency: USD+USD

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Money.php:31
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\MoneyCalculatorTest.php:33

ERRORS!
T

[Killed] Throw_
Money.php:35:13
     public function add(Money $money): Money
     {
         if ($money->currency != $this->currency) {
-            throw new CanNotAddDifferentCurrency($money->currency, $this->currency);
+            new CanNotAddDifferentCurrency($money->currency, $this->currency);
         }
         return Money::fabricMoney($this->amount + $money->amount, $this->currency);
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_can_not_add_money_when_currency_are_different
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_can_not_add_money_when_currency_are_different
Failed asserting that exception of type "MoneyProblem\Domain\CanNotAddDifferentCurrency" is thrown.

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.

[Killed] Plus
Money.php:37:9
         if ($money->currency != $this->currency) {
             throw new CanNotAddDifferentCurrency($money->currency, $this->currency);
         }
-        return Money::fabricMoney($this->amount + $money->amount, $this->currency);
+        return Money::fabricMoney($this->amount - $money->amount, $this->currency);
     }
 
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_can_add_money_when_currency_are_the_same
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_can_add_money_when_currency_are_the_same
MoneyProblem\Domain\CanNotCreateNegativeAmount: dont create negative amount

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Money.php:16
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Money.php:33
C

[Killed] PublicVisibility
Money.php:40:5
         return Money::fabricMoney($this->amount + $money->amount, $this->currency);
     }
 
-    public function times(int $value): Money
+    protected function times(int $value) : Money
     {
         return Money::fabricMoney($this->amount * $value, $this->currency);
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_multiply_eur
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_multiply_eur
Error: Call to protected method MoneyProblem\Domain\Money::times() from scope Tests\MoneyProblem\MoneyCalculatorTest

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\MoneyCalculatorTest.php:50

ERRORS!
Tests: 4, Assertions: 6, Errors: 1.

[Killed] Multiplication
Money.php:42:9
 
     public function times(int $value): Money
     {
-        return Money::fabricMoney($this->amount * $value, $this->currency);
+        return Money::fabricMoney($this->amount / $value, $this->currency);
     }
 
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_multiply_eur
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_multiply_eur
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
-    'amount' => 100.0
+    'amount' => 1.0

[Killed] PublicVisibility
Money.php:45:5
         return Money::fabricMoney($this->amount * $value, $this->currency);
     }
 
-    public function divide(int $value): Money
+    protected function divide(int $value) : Money
     {
         if ($value == 0) {
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_divide_by_zero
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_divide_by_zero
Failed asserting that exception of type "Error" matches expected exception "MoneyProblem\Domain\CanNotDivideByZero". Message was: "Call to protected method MoneyProblem\Domain\Money::divide() from scope Tests\MoneyProblem\MoneyCalculatorTest" at
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyP

[Killed] AssignmentEqual
Money.php:47:9
 
     public function divide(int $value): Money
     {
-        if ($value == 0) {
+        if ($value = 0) {
             throw new CanNotDivideByZero($value);
         }
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_divide_by_zero
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_divide_by_zero
Failed asserting that exception of type "DivisionByZeroError" matches expected exception "MoneyProblem\Domain\CanNotDivideByZero". Message was: "Division by zero" at
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Money.php:44
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-wo

[Killed] Equal
Money.php:47:9
 
     public function divide(int $value): Money
     {
-        if ($value == 0) {
+        if ($value != 0) {
             throw new CanNotDivideByZero($value);
         }
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_divide_by_zero
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_divide_by_zero
Failed asserting that exception of type "DivisionByZeroError" matches expected exception "MoneyProblem\Domain\CanNotDivideByZero". Message was: "Division by zero" at
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Money.php:44
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-wo

[Killed] Throw_
Money.php:48:13
     public function divide(int $value): Money
     {
         if ($value == 0) {
-            throw new CanNotDivideByZero($value);
+            new CanNotDivideByZero($value);
         }
         return Money::fabricMoney($this->amount / $value, $this->currency);
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_divide_by_zero
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_divide_by_zero
Failed asserting that exception of type "DivisionByZeroError" matches expected exception "MoneyProblem\Domain\CanNotDivideByZero". Message was: "Division by zero" at
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Money.php:44
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-wo

[Killed] Division
Money.php:50:9
         if ($value == 0) {
             throw new CanNotDivideByZero($value);
         }
-        return Money::fabricMoney($this->amount / $value, $this->currency);
+        return Money::fabricMoney($this->amount * $value, $this->currency);
     }
 
killedBy: Tests\MoneyProblem\MoneyCalculatorTest::test_divide_eur
statusReason: 1) Tests\MoneyProblem\MoneyCalculatorTest::test_divide_eur
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
-    'amount' => 10.0
+    'amount' => 1000.0

[Killed] PublicVisibility
Money.php:58:5
         return $this->currency;
     }
 
-    public function getAmmount(): float
+    protected function getAmmount() : float
     {
         return $this->amount;
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
Error: Call to protected method MoneyProblem\Domain\Money::getAmmount() from scope MoneyProblem\Domain\Bank

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:80
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyPr

[Killed] PublicVisibility
Money.php:63:5
         return $this->amount;
     }
 
-    public function hasCurrency(Currency $currency): bool
+    protected function hasCurrency(Currency $currency) : bool
     {
         return $this->currency->equals($currency);
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
Error: Call to protected method MoneyProblem\Domain\Money::hasCurrency() from scope MoneyProblem\Domain\Bank

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:55
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyP

[Killed] PublicVisibility
Money.php:68:5
         return $this->currency->equals($currency);
     }
 
-    public function convert(int $amount, Currency $currency): Money
+    protected function convert(int $amount, Currency $currency) : Money
     {
         return new Money($amount, $currency);
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluate_usd_to_eur
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluate_usd_to_eur
Error: Call to protected method MoneyProblem\Domain\Money::convert() from scope MoneyProblem\Domain\Bank

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Bank.php:57
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\B
