[Killed] PublicVisibility
Portfolio.php:21:5
     /**
      * @throws MissingExchangeRateException
      */
-    public function evaluate(Currency $currency, Bank $bank)
+    protected function evaluate(Currency $currency, Bank $bank)
     {
         $result = 0;
killedBy: Tests\MoneyProblem\PortfolioTest::test_empty_portfolio_is_evaluated_to_zero
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_empty_portfolio_is_evaluated_to_zero
Error: Call to protected method MoneyProblem\Domain\Portfolio::evaluate() from scope Tests\MoneyProblem\PortfolioTest

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\PortfolioTest.php:21

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Foreach_
Portfolio.php:24:9
     public function evaluate(Currency $currency, Bank $bank)
     {
         $result = 0;
-        foreach ($this->amount as $data) {
-            $result += $bank->convert($data["amount"], $data["currency"], $currency);
-        }
+        foreach (array() as $data) {
         return $result;
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
Failed asserting that 0 matches expected 10.

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\PortfolioTest.php:34

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] PlusEqual
Portfolio.php:25:13
     {
         $result = 0;
         foreach ($this->amount as $data) {
-            $result += $bank->convert($data["amount"], $data["currency"], $currency);
+            $result -= $bank->convert($data["amount"], $data["currency"], $currency);
         }
         return $result;
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
Failed asserting that -10.0 matches expected 10.

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\PortfolioTest.php:34

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] Assignment
Portfolio.php:25:13
     {
         $result = 0;
         foreach ($this->amount as $data) {
-            $result += $bank->convert($data["amount"], $data["currency"], $currency);
+            $result = $bank->convert($data["amount"], $data["currency"], $currency);
         }
         return $result;
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_add_usd_and_krw_and_eur_evaluate_to_eur
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_add_usd_and_krw_and_eur_evaluate_to_eur
Failed asserting that 10.0 matches expected 37.

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\PortfolioTest.php:67

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] PublicVisibility
Portfolio.php:35:5
      * @param Currency $currency
      * @return void
      */
-    public function add(int $amount_to_add, Currency $currency)
+    protected function add(int $amount_to_add, Currency $currency)
     {
         if (!isset($this->amount[(string) $currency]["currency"])) {
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
Error: Call to protected method MoneyProblem\Domain\Portfolio::add() from scope Tests\MoneyProblem\PortfolioTest

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\PortfolioTest.php:32

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] LogicalNot
Portfolio.php:37:9
      */
     public function add(int $amount_to_add, Currency $currency)
     {
-        if (!isset($this->amount[(string) $currency]["currency"])) {
+        if (isset($this->amount[(string) $currency]["currency"])) {
             $this->amount[(string) $currency] = ["currency" => $currency, "amount" => 0];
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
Undefined array key "EUR"

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\src\MoneyProblem\Domain\Portfolio.php:35
C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\PortfolioTest.php:32

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] DecrementInteger
Portfolio.php:38:13
     public function add(int $amount_to_add, Currency $currency)
     {
         if (!isset($this->amount[(string) $currency]["currency"])) {
-            $this->amount[(string) $currency] = ["currency" => $currency, "amount" => 0];
+            $this->amount[(string) $currency] = ["currency" => $currency, "amount" => -1];
         }
         $this->amount[(string) $currency]["amount"] += $amount_to_add;
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
Failed asserting that 9.0 matches expected 10.

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\PortfolioTest.php:34

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Portfolio.php:38:13
     public function add(int $amount_to_add, Currency $currency)
     {
         if (!isset($this->amount[(string) $currency]["currency"])) {
-            $this->amount[(string) $currency] = ["currency" => $currency, "amount" => 0];
+            $this->amount[(string) $currency] = ["currency" => $currency, "amount" => 1];
         }
         $this->amount[(string) $currency]["amount"] += $amount_to_add;
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
Failed asserting that 11.0 matches expected 10.

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\PortfolioTest.php:34

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] PlusEqual
Portfolio.php:40:9
         if (!isset($this->amount[(string) $currency]["currency"])) {
             $this->amount[(string) $currency] = ["currency" => $currency, "amount" => 0];
         }
-        $this->amount[(string) $currency]["amount"] += $amount_to_add;
+        $this->amount[(string) $currency]["amount"] -= $amount_to_add;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_portfolio_is_evaluated_to_the_same_currency
Failed asserting that -10.0 matches expected 10.

C:\Users\mathi\Documents\Travail\BUT\S5\xtrem-craft-workshop_leslicornes\php\tests\MoneyProblem\PortfolioTest.php:34

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Survived] Assignment
Portfolio.php:40:9
         if (!isset($this->amount[(string) $currency]["currency"])) {
             $this->amount[(string) $currency] = ["currency" => $currency, "amount" => 0];
         }
-        $this->amount[(string) $currency]["amount"] += $amount_to_add;
+        $this->amount[(string) $currency]["amount"] = $amount_to_add;
     }
 

[NoCoverage] PublicVisibility
Portfolio.php:48:5
      * @param Currency $currency
      * @return void
      */
-    public function addMoney(Money $money)
+    protected function addMoney(Money $money)
     {
         $this->money[(string) $money->getCurrency()]["money"] += $money;

[NoCoverage] PlusEqual
Portfolio.php:50:9
      */
     public function addMoney(Money $money)
     {
-        $this->money[(string) $money->getCurrency()]["money"] += $money;
+        $this->money[(string) $money->getCurrency()]["money"] -= $money;
     }
 }

[NoCoverage] Assignment
Portfolio.php:50:9
      */
     public function addMoney(Money $money)
     {
-        $this->money[(string) $money->getCurrency()]["money"] += $money;
+        $this->money[(string) $money->getCurrency()]["money"] = $money;
     }
 }
